<!-- placeholder-1 -->
```fish
terraform plan -chdir='terraform/production/vpc'
```
<!-- placeholder-2 -->

<details><summary>Diff of changes.</summary>

```diff
+ module.vpc.aws_db_subnet_group.database[0] will be created
+ module.vpc.aws_default_network_acl.this[0] will be created
+ module.vpc.aws_default_route_table.default[0] will be created
+ module.vpc.aws_default_security_group.this[0] will be created
+ module.vpc.aws_internet_gateway.this[0] will be created
+ module.vpc.aws_route.public_internet_gateway[0] will be created
+ module.vpc.aws_route_table.private[0] will be created
+ module.vpc.aws_route_table.private[1] will be created
+ module.vpc.aws_route_table.private[2] will be created
+ module.vpc.aws_route_table.public[0] will be created
+ module.vpc.aws_route_table_association.database[0] will be created
+ module.vpc.aws_route_table_association.database[1] will be created
+ module.vpc.aws_route_table_association.database[2] will be created
+ module.vpc.aws_route_table_association.private[0] will be created
+ module.vpc.aws_route_table_association.private[1] will be created
+ module.vpc.aws_route_table_association.private[2] will be created
+ module.vpc.aws_route_table_association.public[0] will be created
+ module.vpc.aws_route_table_association.public[1] will be created
+ module.vpc.aws_route_table_association.public[2] will be created
+ module.vpc.aws_subnet.database[0] will be created
+ module.vpc.aws_subnet.database[1] will be created
+ module.vpc.aws_subnet.database[2] will be created
+ module.vpc.aws_subnet.private[0] will be created
+ module.vpc.aws_subnet.private[1] will be created
+ module.vpc.aws_subnet.private[2] will be created
+ module.vpc.aws_subnet.public[0] will be created
+ module.vpc.aws_subnet.public[1] will be created
+ module.vpc.aws_subnet.public[2] will be created
+ module.vpc.aws_vpc.this[0] will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 29 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @chris3ware at 2024-10-25T09:53:21Z [(view log)](https://github.com/3ware/aws-network-speciality/actions/runs/11515979428/job/32057714494#step:4:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for a4l-vpc1-production"
      + id                      = (known after apply)
      + name                    = "a4l-vpc1-production"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "a4l-vpc1-production"
        }
      + tags_all                = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production"
        }
      + vpc_id                  = (known after apply)
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "a4l-vpc1-production-default"
        }
      + tags_all               = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "a4l-vpc1-production-default"
        }
      + tags_all               = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "a4l-vpc1-production-default"
        }
      + tags_all               = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "a4l-vpc1-production"
        }
      + tags_all = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "a4l-vpc1-production-private-us-east-1a"
        }
      + tags_all         = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-private-us-east-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "a4l-vpc1-production-private-us-east-1b"
        }
      + tags_all         = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-private-us-east-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "a4l-vpc1-production-private-us-east-1c"
        }
      + tags_all         = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-private-us-east-1c"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "a4l-vpc1-production-public"
        }
      + tags_all         = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[2] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-production-db-us-east-1a"
        }
      + tags_all                                       = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-db-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-production-db-us-east-1b"
        }
      + tags_all                                       = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-db-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[2] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.144.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-production-db-us-east-1c"
        }
      + tags_all                                       = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-db-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-production-private-us-east-1a"
        }
      + tags_all                                       = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-private-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-production-private-us-east-1b"
        }
      + tags_all                                       = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-private-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.160.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-production-private-us-east-1c"
        }
      + tags_all                                       = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-private-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-production-public-us-east-1a"
        }
      + tags_all                                       = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-public-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.112.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-production-public-us-east-1b"
        }
      + tags_all                                       = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-public-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.176.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "a4l-vpc1-production-public-us-east-1c"
        }
      + tags_all                                       = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production-public-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "a4l-vpc1-production"
        }
      + tags_all                             = {
          + "3ware:environment"          = "production"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-production"
          + "Name"                       = "a4l-vpc1-production"
        }
    }

Plan: 29 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform.51...chdir..terraform.production.vpc..tf.plan -->
<!-- placeholder-6 -->